app/views/ttts/new.html.erb

SELECT "users".* FROM "users"
---
  <%= hidden_field_tag 'ttt[player_x_id]', current_user.id  %>
  <%= f.collection_select :player_o_id, User.all, :id, :name %>