app/views/ttts/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1
---
    <% if current_user.id == @ttt.player_x_id %>
    <%= User.find(@ttt.player_o_id).name %>

SELECT  "moves".* FROM "moves"  WHERE "moves"."ttt_id" = $1  ORDER BY "moves"."id" DESC LIMIT 1
---

  <% if @ttt.moves.any? && @ttt.moves.last.user_id != current_user.id %>

SELECT  "moves".* FROM "moves"  WHERE "moves"."ttt_id" = $1 AND "moves"."position" = 0 LIMIT 1
---
      <td>
        <% if @ttt.moves.find_by_position(cell) && @ttt.moves.find_by_position(cell).user_id == @ttt.player_x_id  %>