app/controllers/ttts_controller.rb

  def create
    @ttt = Ttt.new(ttt_params)
    @ttt.save
---
INSERT INTO "ttts" ("created_at", "player_o_id", "player_x_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def show
    @ttt = Ttt.find(params[:id])
---
SELECT  "ttts".* FROM "ttts"  WHERE "ttts"."id" = $1 LIMIT 1

  def move
    @ttt = Ttt.find(params[:id])
    @move = Move.new(user_id: current_user.id, position: params[:position], ttt_id: @ttt.id)
    if @move.save
      # u = @ttt.match_won
      # raise
      if @ttt.player_o_id==10 #&& !@ttt.match_won
        # raise
        @ttt.moves.create(user_id: 10, position: @ttt.ai)
---
SELECT  "ttts".* FROM "ttts"  WHERE "ttts"."id" = $1 LIMIT 1
INSERT INTO "moves" ("created_at", "position", "ttt_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"