app/models/move.rb

SELECT "moves".* FROM "moves"  WHERE "moves"."ttt_id" = $1
---
  def check_if_occuppied
    positions = ttt.moves.map {|move| move.position}