app/models/ttt.rb

  def self.leader_board
    t = Ttt.winners
    res=Hash[t.map {|p| p.win_id}.group_by {|x| x}.map {|k,v| [k,v.count]}]
    res.sort_by(&:last).reverse.map {|k , v|  " #{User.find(k).name} won: #{v} game(s) "}
---
SELECT "ttts".* FROM "ttts"  WHERE (win_id is not null)
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1